# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
cursor.execute('''SELECT e.lastName, e.firstName
FROM employees e
JOIN offices o
using(officeCode)
WHERE o.city = "Boston"''').fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [8]:
import pandas as pd

In [11]:
cursor.execute('''SELECT o.city, COUNT(*)
FROM offices o
JOIN employees e
using(officeCode)
GROUP BY o.officeCode
''')
df = pd.DataFrame(cursor.fetchall())
df

               0  1
0  San Francisco  6
1         Boston  2
2            NYC  2
3          Paris  5
4          Tokyo  2
5         Sydney  4
6         London  2

No.

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [19]:
cursor.execute('''SELECT e.firstName, e.lastName, p.productName
FROM products p
JOIN orderdetails ON p.productCode = orderdetails.productCode
JOIN orders ON orderdetails.orderNumber = orders.orderNumber
JOIN customers ON orders.customerNumber = customers.customerNumber
JOIN employees e ON customers.salesRepEmployeeNumber = e.employeeNumber
''')
df = pd.DataFrame(cursor.fetchall())
print(len(df))
df.head()

2996

        0         1                                      2
0  George    Vanauf  1969 Harley Davidson Ultimate Chopper
1    Loui    Bondur  1969 Harley Davidson Ultimate Chopper
2    Loui    Bondur  1969 Harley Davidson Ultimate Chopper
3  Leslie  Thompson  1969 Harley Davidson Ultimate Chopper
4  Leslie  Jennings  1969 Harley Davidson Ultimate Chopper

## Level Up: Display the Number of Products each Employee Has sold

In [21]:
cursor.execute('''SELECT e.firstName, e.lastName, COUNT(p.productCode)
FROM products p
JOIN orderdetails ON p.productCode = orderdetails.productCode
JOIN orders ON orderdetails.orderNumber = orders.orderNumber
JOIN customers ON orders.customerNumber = customers.customerNumber
JOIN employees e ON customers.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.firstName, e.lastName
''')
df = pd.DataFrame(cursor.fetchall())
print(len(df))
df

15

           0          1    2
0       Andy     Fixter  185
1      Barry      Jones  220
2   Foon Yue      Tseng  142
3     George     Vanauf  211
4     Gerard  Hernandez  396
5      Julie   Firrelli  124
6      Larry       Bott  236
7     Leslie   Jennings  331
8     Leslie   Thompson  114
9       Loui     Bondur  177
10      Mami      Nishi  137
11    Martin     Gerard  114
12    Pamela   Castillo  272
13     Peter      Marsh  185
14     Steve  Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!